Tekla.Structures.Catalogs.DrawingItemEnumerator
The DrawingItemEnumerator class allows to loop through the catalog drawing items.

Tekla.Structures.Catalogs.DrawingItemEnumerator.#ctor
Creates a new instance of the DrawingItemEnumerator.

Tekla.Structures.Catalogs.DrawingItemEnumerator.System#Collections#IEnumerator#Current
Implementation for the Current property required by IEnumerator. The returned object
is always of type DrawingItem.

Tekla.Structures.Catalogs.DrawingItemEnumerator.Current
Returns a drawing item instance of the current element.

Tekla.Structures.Catalogs.DrawingItemEnumerator.MoveNext
Moves to the next item in the enumerator.
Returns: False on failure.

Tekla.Structures.Catalogs.DrawingItemEnumerator.Reset
Resets the enumerator to the beginning.

Tekla.Structures.Catalogs.DrawingItemEnumerator.GetSize
Returns the total amout of items.
Returns: The total amount of items.

Tekla.Structures.Catalogs.DrawingItemEnumerator.SelectDrawingItem(System.String)
Selects a drawing item in the catalog with the given name.
Name: The name of the drawing item to select.
Returns: The first DrawingItem that matches the conditions.